ka2_2024/src/InformationRegisters/НалогообложениеПрибылиОрганизаций/НалогообложениеПрибылиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НалогообложениеПрибылиОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВариантНалогообложенияПрибыли</name>
    <type>
      <types>CatalogRef.ВариантыНалогообложенияПрибыли</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектУчета</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбособленногоУчетаТоваров</name>
    <type>
      <types>EnumRef.ВариантыОбособленногоУчетаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводственноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПланирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИнтервалаПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеИнтервалаПланирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УправлениеМаршрутнымиЛистами</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляРасписанияРЦКоличествоИнтервалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляРасписанияРЦНапоминаниеДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляГрафикаПроизводстваКоличествоИнтервалов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПооперационногоУправления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеДоступностиДляГрафикаПроизводстваНапоминаниеДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеДиспетчер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаРегистрациюВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаРегистрациюВыполненияЕдИзм</name>
    <type>
      <types>EnumRef.ЕдиницыИзмеренияВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьСебестоимостьПоСериям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводствоБезЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСписаниеЗатратНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПолученияПолуфабрикатов</name>
    <type>
      <types>EnumRef.СпособыПолученияПолуфабрикатовПроизводимыхВПроцессе</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПооперационноеУправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьМатериалыВОперациях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВыходныеИзделияВОперациях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПооперационноеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОформленияВыработки</name>
    <type>
      <types>EnumRef.ПериодичностьОформленияВыработкиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКТУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТарифныеСтавки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтработанноеВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБригадныеНаряды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПерсональныеНаряды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНастройкиГрафикаРаботы</name>
    <type>
      <types>EnumRef.СпособыНастройкиГрафикаРаботыПодразделений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСменныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизводственныеУчастки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикиРаботы</name>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/Catalogs/НаправленияДеятельности/НаправленияДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаправленияДеятельности</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыНаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетДоходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетЗатрат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетДенежныхСредствРаздельно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетДенежныхСредствПоКорреспонденции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВнеоборотныхАктивов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДСОпределяетсяВДокументе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНаправленияДеятельности</name>
    <type>
      <types>EnumRef.ТипыНаправленийДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемФинансированияКонтракта</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаМатериалы</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаОплатуТруда</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеПроизводственныеЗатраты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщепроизводственныеЗатраты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщехозяйственныеЗатраты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческиеРасходы</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрибыльКонтракта</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>УправленческиеРасходы</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКредитования</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентыПоКредитам</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйКонтракт</name>
    <type>
      <types>CatalogRef.ГосударственныеКонтракты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключенияКонтракта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтдельногоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВозмещаемыхРасходов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетРасчетовСПоставщиками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделЛицевогоСчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДеятельности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДеятельности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопускаетсяОбособлениеСверхПотребности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлениеПризнакаДопускаетсяОбособлениеСверхПотребностиНеТребуется</name>
    <comment>Используется для обновления информационной базы</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/InformationRegisters/НалогообложениеПрибылиОрганизаций/Forms/ФормаНастроек/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Свойство("Организация") Или Не Параметры.Свойство("Период") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("Организация", Организация);
	Параметры.Свойство("Период",      Период);
	ПериодИсходный = Период;
	
	Если Не ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.НалогообложениеПрибылиОрганизаций) Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ЗаполнитьДанныеНастроек();
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если СтрНайти(ИсточникВыбора.ИмяФормы, "СтатьиДоходов") <> 0
		Или СтрНайти(ИсточникВыбора.ИмяФормы, "Номенклатура") <> 0 Тогда
		
		СтрокаНастройки = Настройки_ОбъектыУчета.Добавить();
		СтрокаНастройки.ОбъектНастройки = ВыбранноеЗначение;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверкаЗаполненияТаблицы(Настройки_Подразделения, "Настройки_Подразделения",
		НСтр("ru = 'Подразделение'"), Отказ);
	ПроверкаЗаполненияТаблицы(Настройки_ОбъектыУчета, "Настройки_ОбъектыУчета",
		НСтр("ru = 'Статья дохода/Номенклатура'"), Отказ);
	ПроверкаЗаполненияТаблицы(Настройки_НаправленияДеятельности, "Настройки_НаправленияДеятельности",
		НСтр("ru = 'Направление деятельности'"), Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьНоменклатуру(Команда)
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора",,
		ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСтатьиДоходов(Команда)
	
	ОткрытьФорму("ПланВидовХарактеристик.СтатьиДоходов.ФормаВыбора",,
		ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьНастройки(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПрименитьНастройкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПрименитьНастройкиНаСервере();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = ПериодИсходный;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Период не может быть пустым.'"));
		Возврат;
	КонецЕсли;
	
	Если Период = ПериодИсходный Тогда
		Возврат;
	КонецЕсли;
	
	ПериодИсходный = Период;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПриИзмененииПериодаЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Загрузить настройки на новую дату?
												|Текущие настройки будут удалены.'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаДляОбособленногоПодразделенияПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	Если Модифицированность Тогда
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("НовоеЗначение", НастройкаДляОбособленногоПодразделения);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПрименитьНастройкиЗавершение", ЭтотОбъект, ПараметрыОповещения);
		
		НастройкаДляОбособленногоПодразделения = Не НастройкаДляОбособленногоПодразделения;
		
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Есть несохраненные настройки.
												|Записать изменения перед продолжением?'"), РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		НастройкаДляОбособленногоПодразделенияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбособленноеПодразделениеПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	Если ЗначениеЗаполнено(ОбособленноеПодразделениеИсходное)
		И ОбособленноеПодразделениеИсходное = ОбособленноеПодразделение Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПрименитьНастройкиЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Есть несохраненные настройки.
												|Записать изменения перед продолжением?'"), РежимДиалогаВопрос.ДаНет);
	Иначе
		НастройкаДляОбособленногоПодразделенияНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьДоступностьЭлементов()

	Элементы.ОбособленноеПодразделение.Доступность = НастройкаДляОбособленногоПодразделения;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНастроек()
	
	Настройки_Подразделения.Очистить();
	Настройки_ОбъектыУчета.Очистить();
	Настройки_НаправленияДеятельности.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НалогообложениеПрибылиОрганизаций.Подразделение КАК ОбъектНастройки,
		|	НалогообложениеПрибылиОрганизаций.ВариантНалогообложенияПрибыли КАК ВариантНалогообложенияПрибыли
		|ИЗ
		|	РегистрСведений.НалогообложениеПрибылиОрганизаций.СрезПоследних(&Период, Организация = &Организация
		|	И Подразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК НалогообложениеПрибылиОрганизаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеПрибылиОрганизаций.ОбъектУчета КАК ОбъектНастройки,
		|	НалогообложениеПрибылиОрганизаций.ВариантНалогообложенияПрибыли КАК ВариантНалогообложенияПрибыли
		|ИЗ
		|	РегистрСведений.НалогообложениеПрибылиОрганизаций.СрезПоследних(&Период, Организация = &Организация
		|	И ОбъектУчета <> ВЫБОР
		|		КОГДА ОбъектУчета ССЫЛКА Справочник.Номенклатура
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		КОГДА ОбъектУчета ССЫЛКА ПланВидовХарактеристик.СтатьиДоходов
		|			ТОГДА ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиДоходов.ПустаяСсылка)
		|	КОНЕЦ) КАК НалогообложениеПрибылиОрганизаций
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НалогообложениеПрибылиОрганизаций.НаправлениеДеятельности КАК ОбъектНастройки,
		|	НалогообложениеПрибылиОрганизаций.ВариантНалогообложенияПрибыли КАК ВариантНалогообложенияПрибыли
		|ИЗ
		|	РегистрСведений.НалогообложениеПрибылиОрганизаций.СрезПоследних(&Период, Организация = &Организация
		|	И НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК
		|		НалогообложениеПрибылиОрганизаций";
	
	Запрос.УстановитьПараметр("Организация", ?(НастройкаДляОбособленногоПодразделения, ОбособленноеПодразделение, Организация));
	Запрос.УстановитьПараметр("Период",      Период);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Если Не РезультатыЗапроса[0].Пустой() Тогда
		Настройки_Подразделения.Загрузить(РезультатыЗапроса[0].Выгрузить());
	КонецЕсли;
	
	Если Не РезультатыЗапроса[1].Пустой() Тогда
		Настройки_ОбъектыУчета.Загрузить(РезультатыЗапроса[1].Выгрузить());
	КонецЕсли;
	
	Если Не РезультатыЗапроса[2].Пустой() Тогда
		Настройки_НаправленияДеятельности.Загрузить(РезультатыЗапроса[2].Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПриИзмененииПериодаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДанныеНастроек();

КонецПроцедуры

&НаСервере
Процедура ПрименитьНастройкиНаСервере()
	
	Если НастройкаДляОбособленногоПодразделения И ЗначениеЗаполнено(ОбособленноеПодразделениеИсходное) Тогда
		ТекущаяОрганизация = ОбособленноеПодразделениеИсходное;
	ИначеЕсли НастройкаДляОбособленногоПодразделения Тогда
		ТекущаяОрганизация = ОбособленноеПодразделение;
	Иначе
		ТекущаяОрганизация = Организация;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных();
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.НалогообложениеПрибылиОрганизаций");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Организация", ТекущаяОрганизация);
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.НалогообложениеПрибылиОрганизаций.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(ТекущаяОрганизация);
		НаборЗаписей.Отбор.Период.Установить(НачалоМесяца(Период));
		НаборЗаписей.Прочитать();
		
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(); // Очистка текущих настроек
		
		Для Каждого СтрокаНастроек Из Настройки_Подразделения Цикл
			Запись = НаборЗаписей.Добавить();
			Запись.Организация   = ТекущаяОрганизация;
			Запись.Период        = Период;
			Запись.Подразделение = СтрокаНастроек.ОбъектНастройки;
			Запись.ВариантНалогообложенияПрибыли = СтрокаНастроек.ВариантНалогообложенияПрибыли;
		КонецЦикла;
		
		Для Каждого СтрокаНастроек Из Настройки_ОбъектыУчета Цикл
			Запись = НаборЗаписей.Добавить();
			Запись.Организация   = ТекущаяОрганизация;
			Запись.Период        = Период;
			Запись.ОбъектУчета   = СтрокаНастроек.ОбъектНастройки;
			Запись.ВариантНалогообложенияПрибыли = СтрокаНастроек.ВариантНалогообложенияПрибыли;
		КонецЦикла;
		
		Для Каждого СтрокаНастроек Из Настройки_НаправленияДеятельности Цикл
			Запись = НаборЗаписей.Добавить();
			Запись.Организация = ТекущаяОрганизация;
			Запись.Период      = Период;
			Запись.НаправлениеДеятельности       = СтрокаНастроек.ОбъектНастройки;
			Запись.ВариантНалогообложенияПрибыли = СтрокаНастроек.ВариантНалогообложенияПрибыли;
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
		Модифицированность = Ложь;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ШаблонСообщения = НСтр("ru = 'Изменение настроек не выполнено по причине:
								|%1'");
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверкаЗаполненияТаблицы(ТаблицаНастроек, ПредставлениеТаблицы, ПредставлениеОбъектаНастроек, Отказ)
	
	ШаблонСообщения = НСтр("ru = 'Не заполнено значение %1'");
	
	Индекс = 0;
	Для Каждого СтрокаНастройки Из ТаблицаНастроек Цикл
		Если Не ЗначениеЗаполнено(СтрокаНастройки.ОбъектНастройки) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, ПредставлениеОбъектаНастроек),,
				СтрШаблон("%1[%2].ОбъектНастройки", ПредставлениеТаблицы, Индекс),, Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаНастройки.ВариантНалогообложенияПрибыли) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, НСтр("ru = 'Вариант налогообложения прибыли'")),,
				СтрШаблон("%1[%2].ВариантНалогообложенияПрибыли", ПредставлениеТаблицы, Индекс),, Отказ);
		КонецЕсли;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПрименитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПрименитьНастройкиНаСервере();
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") И ДополнительныеПараметры.Свойство("НовоеЗначение") Тогда
		НастройкаДляОбособленногоПодразделения = ДополнительныеПараметры.НовоеЗначение;
	КонецЕсли;
	НастройкаДляОбособленногоПодразделенияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НастройкаДляОбособленногоПодразделенияНаСервере()

	Настройки_НаправленияДеятельности.Очистить();
	Настройки_ОбъектыУчета.Очистить();
	Настройки_Подразделения.Очистить();
	
	Если Не НастройкаДляОбособленногоПодразделения Тогда
		ОбособленноеПодразделение = Неопределено;
		ОбособленноеПодразделениеИсходное = Неопределено;
	КонецЕсли;
	
	Если ОбособленноеПодразделениеИсходное <> ОбособленноеПодразделение Тогда
		ОбособленноеПодразделениеИсходное = ОбособленноеПодразделение;
	КонецЕсли;
	
	ЗаполнитьДанныеНастроек();
	УстановитьДоступностьЭлементов();
	
	Модифицированность = Ложь;

КонецПроцедуры

#КонецОбласти
